src/config/AccumulationRegisters/ТоварыНаОтветственномХранении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаОтветственномХранении</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ЗаказПоОтветственномуХранению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаказПоОтветственномуХранению</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоОтветственномуХранению</xr:Item>
				<xr:Item>Document.ЗаданиеНаОтгрузку</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоОтветственномуХранению</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоОтветственномуХранению</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Documents/ОперацияПоОтветственномуХранению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ОперацияПоОтветственномуХранению</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоОтветственномуХранению</xr:Item>
				<xr:Item>Document.ЗаявкаНаВозвратТоваров</xr:Item>
				<xr:Item>Document.ЗаявкаНаБрак</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДанныеПоГрузчикам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыАдресноеХранение</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаОтветственномХранении</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоОтветственномуХранению</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоОтветственномуХранению</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаБрак</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоПогрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бригадир</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыАдресноеХранение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ТоварыНаОтветственномХранении/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
		
	ПроверкаПериодаЗаписей(ЭтотОбъект, Отказ);
	
КонецПроцедуры


Процедура КонтрольНаСоответствиеОснованию(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
	   Запрос=Новый Запрос;
	   
	   Запрос.Текст="
| ВЫБРАТЬ
| ДвиженияПоОснованию.Контрагент Контрагент,
| ДвиженияПоОснованию.ДоговорКонтрагента ДоговорКонтрагента,
| ДвиженияПоОснованию.ВидОперации ВидОперации,
| ДвиженияПоОснованию.Номенклатура Номенклатура,
| ЕстьNULL(ОснованиеТовары.Количество,0) КоличествоПоОснованию,
| ЕстьNULL(ДвиженияПоОснованию.Количество,0) ТребуемоеКоличество
|  
|	ИЗ
| 
| (ВЫБРАТЬ
|	Ссылка.Контрагент Контрагент,
|	Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	Ссылка.ВидОперации ВидОперации,
|	Номенклатура,
|	Количество
|ИЗ
|	Документ.ЗаказПоОтветственномуХранению.Товары 
|	ГДЕ Ссылка = &Основание И Ссылка.Проведен) ОснованиеТовары
|	ПРАВОЕ СОЕДИНЕНИЕ(
|	ВЫБРАТЬ
|	А.Контрагент,
|	А.ДоговорКонтрагента,
|	А.ВидОперации,
|	А.Номенклатура,
|	СУММА(А.Количество) Количество ИЗ
|	( ВЫБРАТЬ Ссылка.Контрагент Контрагент,
|	Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	Ссылка.ВидОперации ВидОперации,
|	Номенклатура,
|	Количество
|ИЗ
|	Документ.ОперацияПоОтветственномуХранению.Товары 
|ГДЕ
|	Ссылка.ДокументОснование =  &Основание
|	И Ссылка.Проведен и Ссылка <>  &Ссылка
|	ОБЪЕДИНИТЬ ВСЕ
|	ВЫБРАТЬ Ссылка.Контрагент Контрагент,
|	Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	Ссылка.ВидОперации ВидОперации,
|	Номенклатура,
|	Количество
|ИЗ
|	Документ.ОперацияПоОтветственномуХранению.Товары 
|ГДЕ
|	Ссылка =  &Ссылка) А
|	СГРУППИРОВАТЬ ПО А.Контрагент,А.ДоговорКонтрагента,
|	А.ВидОперации, А.Номенклатура
|	) ДвиженияПоОснованию
|	ПО ОснованиеТовары.Контрагент=ДвиженияПоОснованию.Контрагент
|	И ОснованиеТовары.ДоговорКонтрагента=ДвиженияПоОснованию.ДоговорКонтрагента
|	И ОснованиеТовары.ВидОперации=ДвиженияПоОснованию.ВидОперации
|	И ОснованиеТовары.Номенклатура=ДвиженияПоОснованию.Номенклатура

|	
|ГДЕ	  ЕстьNULL(ДвиженияПоОснованию.Количество,0)-  ЕстьNULL(ОснованиеТовары.Количество,0) >0 ";

Запрос.УстановитьПараметр("Основание",ДокументОбъект.ДокументОснование); 
Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);

Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда    
		СтрокаСообщения = "Количество  по номенклатуре "+СокрЛП(Выборка.Номенклатура.Наименование) + " превышает количество по заказу "+ 
			Строка(ДокументОбъект.ДокументОснование);
			
			ОшибкаНетОстатка(СтрокаСообщения, Выборка.КоличествоПоОснованию, Выборка.ТребуемоеКоличество,
			Выборка.Номенклатура.БазоваяЕдиницаИзмерения, Отказ, "");

			//Сообщить(СтрокаСообщения,СтатусСообщения.Важное);
			//Отказ=Истина;
	КонецЕсли;	

КонецПроцедуры	

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщегние.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	
	ИмяТаблицы          = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	
	Запрос =Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
|	ОперацияПоОтвХранению.Контрагент Контрагент,
|	ОперацияПоОтвХранению.ДоговорКонтрагента ДоговорКонтрагента,
|	ОперацияПоОтвХранению.Склад Склад,
|	ОперацияПоОтвХранению.Номенклатура Номенклатура,
|	ЕстьNULL(ОтветственноеХранениеОстатки.КоличествоОстаток,0)  КоличествоОстаток,
|	ЕстьNULL(ОперацияПоОтвХранению.ДокументКоличество,0)  ДокументКоличество,
|	ЕстьNULL(ОперацияПоОтвХранению.ДокументКоличество,0)-ЕстьNULL(ОтветственноеХранениеОстатки.КоличествоОстаток,0) ПревышениеОстатка
|	ИЗ
|	(ВЫБРАТЬ
|	Ссылка.Контрагент Контрагент,
|   Ссылка.ДоговорКонтрагента ДоговорКонтрагента,
|	// Ссылка.Склад Склад,
|	 Склад,
|	Номенклатура,
|	СУММА(Количество) ДокументКоличество
|	ИЗ	Документ.ОперацияПоОтветственномуХранению.Товары 
|	ГДЕ Ссылка = &Ссылка
|	СГРУППИРОВАТЬ ПО Ссылка.Контрагент, Ссылка.ДоговорКонтрагента,Склад,Номенклатура) ОперацияПоОтвХранению
|	ЛЕВОЕ СОЕДИНЕНИЕ
|	(ВЫБРАТЬ 
|	Контрагент,
|	ДоговорКонтрагента,
|	Склад,
|	Номенклатура,
|	ЕстьNULL(КоличествоОстаток,0)  КоличествоОстаток
|	ИЗ
|	РегистрНакопления.ТоварыНаОтветственномХранении.Остатки(&ДатаОстатков,	Контрагент = &Контрагент 
|)) КАК ОтветственноеХранениеОстатки
|	ПО  ОперацияПоОтвХранению.Контрагент=ОтветственноеХранениеОстатки.Контрагент
|   //ТекстДоговора
|	И ОперацияПоОтвХранению.Склад=ОтветственноеХранениеОстатки.Склад
|	И ОперацияПоОтвХранению.Номенклатура=ОтветственноеХранениеОстатки.Номенклатура
|ГДЕ	ЕстьNULL(ОперацияПоОтвХранению.ДокументКоличество,0)-ЕстьNULL(ОтветственноеХранениеОстатки.КоличествоОстаток,0)>0";	
	
	Запрос.УстановитьПараметр("Контрагент",СтруктураШапкиДокумента.Контрагент);
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ДатаОстатков",ДокументОбъект.Дата);
	
	Если не ЗначениеНеЗаполнено(СтруктураШапкиДокумента.ДоговорКонтрагента) Тогда // если в операции выбран договор, тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"//ТекстДоговора", " И ОперацияПоОтвХранению.ДоговорКонтрагента=ОтветственноеХранениеОстатки.ДоговорКонтрагента ");
	КонецЕсли;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда    
		Если Выборка.ПревышениеОстатка>0 Тогда
			СтрокаСообщения = "Остатка товара на ответственном хранении по контрагенту:"+СокрЛП(Выборка.Контрагент.Наименование)+
			" по складу: "+СокрЛП(Выборка.Склад.Наименование)+ " по номенклатуре :"+СокрЛП(Выборка.Номенклатура.Наименование) + " не достаточно.";
			ОшибкаНетОстатка(СтрокаСообщения, Выборка.КоличествоОстаток, Выборка.ДокументКоличество,
			Выборка.Номенклатура.БазоваяЕдиницаИзмерения, Отказ, "");
			
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры // КонтрольОстатков()
